/*题目编号：Exp04-Basic02

题目名称：n倍数关系

题目描述：

给定若干不完全相同的正整数（数值小于10000）和n（n<5)，计算这些正整数里面有多少数对满足：
其中一个是另一个的n倍。例如：1 4 3 2 9 7 18 22，n=3时得到的答案是2；因为3是1的3倍，9是3的3倍。


输入：输入第一行给出正整数n的值，接下来包括多组测试数据。每组数据最多100个整数占用一行，
以数字0结束(不计入100个整数里)。测试数据不超过20组，最后一行只包括-1，表示输入数据结束。

输出：对每组输入数据，输出一行，给出有多少数对满足其中一个是另一个n倍；如果没有满足要求的数对，则输出0。

（注：最后一行末尾无换行符等多余字符）。*/

#include <stdio.h>

int s[110];
int* pt = s;
int* pt_end;

int main(){
    int n, a;
    scanf("%d", &n);
    int ctd = 1;
    while ((scanf("%d", &a)) == 1 && a != -1){
        if (a == 0){
            pt_end = pt;
            int ct = 0;
            for (int* i = s;i < pt_end; i++){
                for(int *j = s;j < pt_end; j++){
                    if ((*i) == (*j) * n){
                        ++ct;
                    }
                }
            }
            if(!ctd)
                printf("\n");
            printf("%d", ct);
            ctd = 0;
            pt = s;
        }
        else{
            *(pt++) = a;
        }
    }
    return 0;
}


